Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.CopyTo Method
 Copies the collection to the input array.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void CopyTo(
	BinaryFilterExpressionItem[] Array,
	int ArrayIndex
)
Public Sub CopyTo (
	Array As BinaryFilterExpressionItem(),
	ArrayIndex As Integer
)
Parameters
Array
Type: Tekla.Structures.Filtering.BinaryFilterExpressionItem[]
The input array. This value cannot be null.
ArrayIndex
Type: System.Int32
The starting index.
Implements
ICollection<T>.CopyTo(T[], Int32)
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the supplied item is null.
ArgumentException | Thrown when the supplied array index is out of bounds.
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace